In [73]:
import pandas as pd
import numpy as np

In [74]:
table1 = pd.read_csv('C:/Users/black/Downloads/솔트룩스/day3 data/store_market_data.csv')

In [17]:
pd.pivot_table(data = table1, index = '회원번호',values = '구매금액',aggfunc = 'sum').sort_values(by='구매금액', ascending=False).head(5)

                구매금액
회원번호
1670400000  38171716
436681536   22549159
381879424   17294603
635659584   16175518
444617792   15037518

In [75]:
df = pd.pivot_table(data = table1, index = ['요일','물품대분류'],values = '구매금액',aggfunc = 'sum').sort_values(by='구매금액', ascending=False).head()
df

               구매금액
요일 물품대분류
월  축산물    345343132
금  축산물    335868647
화  축산물    319417282
수  축산물    301478654
목  축산물    299340046

In [80]:
df.loc[['월']]

               구매금액
요일 물품대분류
월  축산물    345343132

In [68]:
pd.pivot_table(data = table1, index = '연령대',values = '구매금액').sort_values(by='구매금액', ascending=False).head()

               구매금액
연령대
50대    11583.128810
70대이상  11527.875457
60대    11343.971437
40대    10630.787030
30대이하   9851.578963

In [71]:
pd.pivot_table(data = table1, index = '공급일자',values = '구매금액',aggfunc = 'sum').sort_values(by='구매금액', ascending=False).tail()

                구매금액
공급일자
2018-04-15  21877349
2018-04-29  21638861
2018-04-01  21490639
2018-06-17  21340313
2018-03-18  20817585

In [72]:
pd.pivot_table(data = table1, index = '공급주차',values = '구매금액',aggfunc = 'sum').sort_values(by='구매금액', ascending=False).head()

           구매금액
공급주차
6     382359856
7     367806188
4     319554190
5     312613161
9     302163801